const infoTechniquesSU = [
    {
        grade: '5級',
        attacks: [
            {
                type: '片手取り',
                techniques: [
                    '一教',
                    '入り身投げ',
                    '四方投げ',
                    '小手返し',
                    '隅落とし',
                    '呼吸法',
                ],
            },
            {
                type: '両手取り',
                techniques: [
                    '一教',
                    '入り身投げ',
                    '四方投げ',
                    '小手返し',
                    '天地投げ',
                ],
            },
            {
                type: '交差取り',
                techniques: [
                    '一教',
                    '入り身投げ',
                    '四方投げ',
                ],
            },
            {
                type: '正面打ち',
                techniques: [
                    '一教',
                    '入り身投げ',
                ],
            },
            {
                type: '横面打ち',
                techniques: [
                    '一教',
                    '入り身投げ',
                ],
            },
            {
                type: '突き',
                techniques: [
                    '一教',
                    '入り身投げ',
                ],
            },
            {
                type: '剣',
                techniques: [
                    '素振り',
                    '切り返し',
                    '四股立ち',
                ],
            },
            {
                type: '杖（突きの部）',
                techniques: [
                    '直突き',
                    '返し突き',
                    '後ろ突き',
                    '突き下段返し',
                    '突き上段返し',
                ],
            },
            {
                type: '基本動作',
                techniques: [
                    '前受け身',
                    '後受け身',
                    '膝行',
                    '前後・四方・八方運動（立ち・座り）',
                ],
            },
            {
                type: 'その他',
                techniques: [
                    '座技呼吸法',
                ],
            },
        ],
    },
    {
        grade: '4級',
        attacks: [
            {
                type: '片手取り',
                techniques: [
                    '二教',
                    '回転投げ',
                ],
            },
            {
                type: '両手取り',
                techniques: [
                    '二教',
                    '回転投げ',
                ],
            },
            {
                type: '交差取り',
                techniques: [
                    '二教',
                ],
            },
            {
                type: '諸手取り',
                techniques: [
                    '一教',
                    '二教',
                    '入り身投げ',
                    '四方投げ',
                    '小手返し',
                    '呼吸法',
                ],
            },
            {
                type: '正面打ち',
                techniques: [
                    '二教',
                    '四方投げ',
                    '小手返し',
                    '回転投げ',
                ],
            },
            {
                type: '横面打ち',
                techniques: [
                    '二教',
                    '四方投げ',
                    '小手返し',
                    '回転投げ',
                ],
            },
            {
                type: '突き',
                techniques: [
                    '二教',
                    '四方投げ',
                    '小手返し',
                    '回転投げ',
                ],
            },
            {
                type: '剣',
                techniques: [
                    '突きの部',
                ],
            },
            {
                type: '杖（面打ちの部）',
                techniques: [
                    '正面打ち込み',
                    '連続面打ち',
                    '面打ち後ろ突き',
                    '左横面後ろ突き',
                    '面打ち下段返し',
                ],
            },
        ],
    },
    // 他の級をここに追加
];